# Test Merge and Join in pandas

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame()
df2 = pd.DataFrame()

In [3]:
df1['year1'] = [2000,2001,2002,2003,2004,2005,2006,2007]
df1['month1'] = ["jan","fev","mar","apr","may","jun","july","aug"]

In [4]:
df1

   year1 month1
0   2000    jan
1   2001    fev
2   2002    mar
3   2003    apr
4   2004    may
5   2005    jun
6   2006   july
7   2007    aug

In [5]:
df2["year2"] = [2001,2003,2005,2007]
df2["month2"] = ["A","B","C","C"]

In [7]:
df1.join(df2.set_index("year2"), on="year1")

   year1 month1 month2
0   2000    jan    NaN
1   2001    fev      A
2   2002    mar    NaN
3   2003    apr      B
4   2004    may    NaN
5   2005    jun      C
6   2006   july    NaN
7   2007    aug      C